#include "common.h"
#include "_small_func_.h"




/**********************************************************************************************
名    称：                  判断两个点是否重合函数（图像坐标系）

功能描述： 判断两个点是否重合
入口参数： I1,I2
出口参数： 0/1

备    注： 0不重合 1重合
**********************************************************************************************/
uint8 pdldsfch_img(zb_imgarr_t I_1,zb_imgarr_t I_2)
{
  if(I_1.j==I_2.j)
  {
    if(I_1.i==I_2.i)
    {
      return 1;
    }
    else
    {
      return 0;
    }
  }
  else
  {
    return 0;
  }
}
/**********************************************************************************************
名    称：                        求中间点函数（图像坐标系）

功能描述： 输入两个点 返回中间点
入口参数： I_1、I_2
出口参数： I_mid

备    注： 
**********************************************************************************************/
zb_imgarr_t zhong_dian_img(zb_imgarr_t I_1,zb_imgarr_t I_2)
{
  zb_imgarr_t I_mid;
  
  I_mid.i=(I_1.i+I_2.i)/2;
  I_mid.j=(I_1.j+I_2.j)/2;
  
  return I_mid;
}